<?
require dirname(__FILE__).'/classes/Minifier.php';
//..............................................................................
// минимизирует код JavaScript файла
//..............................................................................
function js_minify($text) {
	if (defined('SKIP_MINIFY')) return $text;	
return	JShrink\Minifier::minify($text);
}

//..............................................................................
// обратная заглушка
//..............................................................................
function minify_js($text)
	{ 
	return js_minify($text);
	}

?>