<?php
// ================ CRC ================
// version: 1.35.02
// hash: ba01cf07df4a5a6a69cf6ad5799df95636df0552b44557e96f156b54da6f531a
// date: 09 September 2019  7:09
// ================ CRC ================
//..............................................................................
// стандартная функция обработки подписей под фотографиями
//..............................................................................
function get_gal_f_caption($data, $gallery_id)
	{
	@$text_str = $data['text'][$gallery_id][CMS_LANG];
	return "<center><b class='f_caption'>{$text_str}</b></center>";
	}
?>