<?php
// ================ CRC ================
// version: 1.15.02
// hash: d2a11564c320bdb967c403254128555c90b2c32b9728637c3cbc04d184e1fba1
// date: 16 September 2018 19:58
// ================ CRC ================
//..............................................................................
// возвращает событие визарда для категории
//..............................................................................
function get_wizard_event($row)
	{
	$o_button = new itButton("&#9783;", 'text', ['target' => '_blank', 'href' => "/".CMS_LANG."/wizard/{$row['id']}/"], 'blue' );
	$result = $o_button->code();
	unset($o_button);

	return $result;		
	}
?>