<?php
// ================ CRC ================
// version: 1.15.02
// hash: b832a5473f75993d7231b11be611eb9ff7adcad319e00bc579496e323258cc64
// date: 16 September 2018 19:58
// ================ CRC ================
//..............................................................................
// возвращает базовое имя картинки, в зависимости от её типа (файл упорядочен!!!)
//..............................................................................
function get_picture_name($name, $type)
	{
	global $pic_tech;
	$ext = get_file_extension($name);
	return $pic_tech[$type]['name'].$name;
	}
?>