<?php
// ================ CRC ================
// version: 1.15.02
// hash: 35fd2eb6892cc72a8d9d3d210e245377e8329a1928db534ae488ce196c0c121d
// date: 16 September 2018 19:58
// ================ CRC ================
//..............................................................................
// определения типа картинки по названию файла
//..............................................................................
function get_picture_tech($addr)
	{
	global $pic_tech;
	$name = basename($addr);
	foreach ($pic_tech as $row)
		{	
		if (strstr($name,$row['name']))
			{
			return $row['name'];
			}
		}

	}
?>