<?
//------------------------------------------------------------------------------
//
//	РАЗРЕШЕННЫЕ ТИПЫ АУДИО И ВИДЕО МАТЕРИАЛОВ
//
//------------------------------------------------------------------------------
define('ALOWED_MEDIA', serialize(array ('TUBE','VIMEO','SOUNDCLOUD','MIXCLOUD')));

//------------------------------------------------------------------------------
//
//	РАЗРЕШЕННЫЕ НАСТРОЙКИ ДЛЯ БЛОКА ИЗОБРАЖЕНИЙ
//
//------------------------------------------------------------------------------
define('DEFAULT_GALLERY_ZOOM', 2);
define('GALLERY_ZOOMS', serialize(array (2,3,4,5,11,13,15))); // 2,3,4,5,6,11,13,15
?>