<?php
// ================ CRC ================
// version: 1.35.03
// hash: e93139ef0649d69b7b1d3ed7272965aa57b6e2413ba7e0cac476c64a73e9972b
// date: 10 March 2021  9:27
// ================ CRC ================
//..............................................................................
// проверяет наличие файла (страницы) на любом сайте в интернет сети
//..............................................................................
function addr_exists($url=NULL)
	{
	$headers = @get_headers($url);

	// проверяем ли ответ от сервера с кодом 200 - ОК
	return strpos(ready_val($headers[0]), '200');
	}
?>