<?php
// ================ CRC ================
// version: 1.35.02
// hash: be5612d0dfcb9ef0b453106514720e8b3b541fb68167e3d18af8b64d6980bbef
// date: 09 September 2019  7:09
// ================ CRC ================
//..............................................................................
// проверят текст на предмет корректного ввода email
//..............................................................................
function isEmail($email)
	{
	return filter_var($email,FILTER_VALIDATE_EMAIL);
//	return preg_match("|^[-0-9a-z_\.]+@[-0-9a-z_^\.]+\.[a-z]{2,6}$|i", $email);
	}
?>