<?php
// ================ CRC ================
// version: 1.15.02
// hash: 3bfa5375104a87aa3b8365973af17aee24a8cdbd0716d0236a8f778688f28372
// date: 16 September 2018 19:58
// ================ CRC ================
global $counter_cat;

//..............................................................................
// itCounter : класс счетчиков и посещаемости сайта сайта
//..............................................................................
class itCounter
	{
	public $code;
	private $fields;

	//..............................................................................
	// конструктор класса - создает данные счетчика для страницы на основе установок
	//..............................................................................
	public function __construct()
		{
		$this->compile();
		}

	//..............................................................................
	// генерирует код для встраивания в сайт
	//..............................................................................
	public function compile()
		{
		global $counter_cat;

		$result = '';
		if (is_array($counter_cat))
		foreach ($counter_cat as $key=>$row)
			{
			if ($row['show']==1)
				{
				$result .= TAB."<!--  ".$row['name']." counter : begin -->\n".
					$row['code'].
					TAB."<!--  ".$row['name']." counter : end -->\n";
				}
			}
		$this->code = $result;
		}


	//..............................................................................
	// возвращает код для встраивания в сайт
	//..............................................................................
	public function code()
		{
		return $this->code;
		}

	} // class
?>