<?php
// ================ CRC ================
// version: 1.35.02
// hash: 171eb62bf536366122ae6360d15eaad6e3c10932d40d79fc7022460aa079c22c
// date: 09 September 2019  7:09
// ================ CRC ================
//..............................................................................
// возвращает строчку через зяпятую в кавычках
//..............................................................................
function implodeQuotas($arr)
	{
	if (!is_array($arr)) return;
	$csv = implode(',', $arr);
        return "'" . str_replace(",", "','", $csv) . "'";
	}
?>