<?php
// ================ CRC ================
// version: 1.35.02
// hash: b1f892e308b55970da05a944adb0f5b89e639c9b28a2e0e857d9c448d8b3a7fd
// date: 09 September 2019  7:09
// ================ CRC ================
//..............................................................................
// возвращает текст, в котором убраны все теги кроме разрешенных
//..............................................................................
function strip_tags_allowed($str)
	{
	return strip_tags($str, ALLOWED_TAGS);
	}
?>