<?
//..............................................................................
// проверяет является ли текст датой
//..............................................................................
function is_Date($str)
	{ 
        $str = str_replace('/', '-', $str);     
        $stamp = strtotime($str);
        if (is_numeric($stamp))
        	{
		$month = date( 'm', $stamp ); 
	    	$day   = date( 'd', $stamp ); 
	    	$year  = date( 'Y', $stamp ); 
		return checkdate($month, $day, $year); 
        	}  
        return false; 
	}

//..............................................................................
// заглушка
//..............................................................................
function isDate($str)
	{
	return is_Date($str);
	}
?>