<?php
// ================ CRC ================
// version: 1.35.02
// hash: e53803e78961551c2f3c709454c351f11a40aebb2137010df728d275aafc95c9
// date: 20 September 2019 15:39
// ================ CRC ================
//..............................................................................
// возвращает редактор поля селектора списка
//..............................................................................
function _f2_select_edit(&$row)
	{
	$o_input = new itSelect2($row);
	$result = $o_input->code();
	$row['element'] = $o_input->element_id;
	$row['result'] = $result;	
	return $result;
	}
?>