<?php
// ================ CRC ================
// version: 1.35.02
// hash: 6cf95ed9164188526c1017588d79a4676d232c8e4170b8c349319787a74c26dc
// date: 20 September 2019 15:39
// ================ CRC ================
//..............................................................................
// возвращает редактор поля ввода почтового адреса
//..............................................................................
function _f2_email_edit(&$row)
	{
	$o_input = new itInput2($row);
	$result = $o_input->code();
	$row['element'] = $o_input->element_id;
	$row['result'] = $result;	
	unset($o_input);
	return $result;

	}
?>