<?php
// ================ CRC ================
// version: 1.35.02
// hash: 8e1e3380f002ee043ebb3038896c62228a5728aa49c8052715e6084c3e67c94c
// date: 10 March 2021  9:27
// ================ CRC ================
//..............................................................................
// возвращает поле описания данных
//..............................................................................
function _f2_desc_view(&$row)
	{
	$row['element'] = "{$row['form_id']}-desc-{$row['ed_key']}";
	$o_desc = new itDesc2($row);
	$result = $o_desc->code();
	unset($o_desc);
	return $result;
	}
?>