<?php
// ================ CRC ================
// version: 1.35.02
// hash: a0950b4b8d7775e24f3d307e55f94153c3a620779080974cd181a213a9bf6499
// date: 10 March 2021  9:27
// ================ CRC ================
//..............................................................................
// возвращает оедактор поля времени
//..............................................................................
function _f2_time_edit(&$row)
	{
	$o_input = new itTime2($row);
	$result = $o_input->code();
	$row['element'] = $o_input->element_id;
	$row['result'] = $result;	
	unset($o_input);
	return $result;
	}
?>