<?php
// ================ CRC ================
// version: 1.35.02
// hash: 663f25f46bf1fc4f7647d9108625c3af306ecd5349796fae364d3b10c82386e5
// date: 29 March 2021 17:26
// ================ CRC ================
//..............................................................................
// возвращает редактор поля скрытых данных
//..............................................................................
function _f2_hidden_edit($row)
	{
	return TAB."<input type=\"hidden\" id=\"{$row['element']}\" name=\"{$row['name']}\" value=\"{$row['value']}\">";
	}
?>