<?php
// ================ CRC ================
// version: 1.35.01
// hash: 0824df01253ccddb92439d8261ae03d1b26b7b7961ad811739d78e4ae03d1918
// date: 09 September 2019  5:10
// ================ CRC ================
//..............................................................................
// возвращает код кнопки в поле формы (версия 2.1)
//..............................................................................
function _f2_button_view($data)
	{
	$o_button = new itButton2($data);
	$result = $o_button->code();
	unset($o_button);
	return $result;
	}
?>