<?php
// ================ CRC ================
// version: 1.35.02
// hash: f47d49b2df862c7978bff947e4c0a9864644418ee334707283b6e64f957f44ae
// date: 10 March 2021  9:27
// ================ CRC ================
//..............................................................................
// возвращает редактор поля галлереи изображений
//..............................................................................
function _f2_upgal_edit(&$row)
	{
	$o_upgal = new itUpGal2($row);
	$result = $o_upgal->code();
	$row['element'] = $o_upgal->element_id;
	$row['result'] = $result;	
	unset($o_upgal);
	return $result;
	}
?>