<?php
// ================ CRC ================
// version: 1.35.02
// hash: 687adf1e74e9d4488ba149e2375cf48c3fbfb012a0216dc2ac582fe45aca538f
// date: 09 September 2019  7:09
// ================ CRC ================
//..............................................................................
// возвращает разширение имени файла
//..............................................................................
function get_file_extension($file_path)
	{
	$basename = basename($file_path); // получение имени файла
	if ( strrpos($basename, '.')!==false )
		{ 
		// проверка на наличии в имени файла символа точки
		// вырезаем часть строки после последнего символа точки в имени файла
		$file_extension = substr($basename, strrpos($basename, '.'));
		} else {
			// в случае отсутствия символа точки в имени файла возвращаем false
			$file_extension = false;
			}
	return $file_extension;
	}
?>