<?php
// ================ CRC ================
// version: 1.37.02
// hash: a0835f29249c8167ffc8980316ccfb32a436ecf7a00c66fe241a37cb4ad19109
// date: 12 September 2019 17:55
// ================ CRC ================
//..............................................................................
// возвращает адрес страницы с которой производился вызов
//..............................................................................
function get_request_url()
	{
	return (isset($_SERVER['HTTPS']) && $_SERVER['HTTPS'] === 'on' ? "https" : "http")."://".$_SERVER['HTTP_HOST'].$_SERVER['REQUEST_URI'];
	}
?>