<?php
// ================ CRC ================
// version: 1.49.02
// hash: 374f3525349118f6e60dee6879202281eede945380f5e981f76e2dfeaffd7c85
// date: 10 March 2021  9:27
// ================ CRC ================
//..............................................................................
// возвращает человекопонятную ссылку товара из полей его записи
//..............................................................................
function get_item_url($item_rec)
	{
	return translit_url("{$item_rec['id']}-".get_field_by_lang($item_rec['title_xml'],CMS_LANG,''));
	}
?>