<?php
// ================ CRC ================
// version: 1.15.02
// hash: a05a6e259e75f11219be3d3b5e234141b7acc88f4dcee47480961d83d289015e
// date: 09 September 2019  5:10
// ================ CRC ================

global $modal_count;
$modal_count = (function_exists('rand_id')) ? rand_id() : time();

//..............................................................................
// itModal : класс всплывающего окна
//..............................................................................
class itModal
	{
	public $code, $fields;
	private $size, $form_id, $animation;

	//..............................................................................
	// конструктор класса - проверяет установку языка при создании обекта класса
	//..............................................................................	
	public function __construct($form_id=NULL)
		{
		global $modal_count;
		$modal_count++;

		if ($form_id==NULL)
			{
			$form_id = "modal-$modal_count";
			}
		$this->form_id 	= $form_id;
		$this->size		= DEFAULT_MODAL_SIZE;
		$this->animation        = DEFAULT_MODAL_ANIMATION;
		$this->ajax		= NULL;
		}


	//..............................................................................
	// устанавливает размер модального окна по ширине
	//..............................................................................	
	public function set_ajax($code=NULL)
		{
		$this->ajax = $code;
		}


	//..............................................................................
	// устанавливает размер модального окна по ширине
	//..............................................................................	
	public function set_size($size=DEFAULT_MODAL_SIZE)
		{
		$this->size = $size;
		}


	//..............................................................................
	// устанавливает размер модального окна по ширине
	//..............................................................................	
	public function set_animation($animation=DEFAULT_MODAL_SIZE)
		{
		$this->$animation = $animation;
		}

	//..............................................................................
	// генерирует html код модального окна и заносит его в поле $code
	//..............................................................................	
	public function compile()
		{
		$rows_code = '';
		if (count($this->fields))
			foreach ($this->fields as $key=>$row)
				{
				$rows_code .= $row;
				}

		$this->code = html_comment("начало кода модального окна: {$this->form_id}").
			TAB."<div class=\"reveal-modal {$this->size}\" id=\"{$this->form_id}\" data-animation=\"{$this->animation}\">".
			$rows_code.
			TAB."<div class=\"close-reveal-modal corner\" ".(($this->ajax!=NULL) ? " onclick=\"{$this->ajax}\" " : '')."></div>".
			TAB."</div>".html_comment("конец кода модального окна: {$this->form_id}");
		}

	//..............................................................................
	// добавляет строку заголовка модального окна
	//..............................................................................	
	public function add_title($title='')
		{
		$this->fields[] = TAB."<div class=\"modal_row title\">$title".TAB."</div>";
		}

	//..............................................................................
	// добавляет строку заголовка модального окна
	//..............................................................................	
	public function add_description($title='')
		{
		$this->fields[] = TAB."<div class=\"modal_row description\">$title".TAB."</div>";
		}


	//..............................................................................
	// добавляет элемент в массив полей кода
	//..............................................................................	
	public function add_field($f_code = '')
		{
		$this->fields[] = $f_code;
		}

	//..............................................................................
	// добавляет элемент в массив полей кода
	//..............................................................................	
	public function add_buttons($b_code = '')
		{
		$this->fields[] = 
			TAB."<div class=\"buttons_div\">".
			$b_code.
			TAB."</div>";
		}


	//..............................................................................
	// возвращает идентификатор модального окна
	//..............................................................................	
	public function form_id()
		{
		return $this->form_id;
		}

	//..............................................................................
	// возвращает код скомпилированного модального окна
	//..............................................................................	
	public function code()
		{
		return $this->code;
		}


	} // class

?>